; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	infrared5 - mode
	thermograph2 - mode
	infrared4 - mode
	infrared1 - mode
	infrared3 - mode
	image0 - mode
	Star0 - direction
	GroundStation6 - direction
	Star8 - direction
	GroundStation10 - direction
	GroundStation1 - direction
	GroundStation9 - direction
	Star3 - direction
	Star7 - direction
	Star4 - direction
	Star2 - direction
	GroundStation5 - direction
	GroundStation12 - direction
	GroundStation11 - direction
	Star13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image0)
	(supports instrument1 infrared5)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 Star3)
	(supports instrument2 infrared1)
	(supports instrument2 infrared5)
	(supports instrument2 infrared4)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation12)
	(supports instrument3 infrared3)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared4)
	(calibration_target instrument3 Star2)
	(supports instrument4 thermograph2)
	(supports instrument4 image0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star13)
	(supports instrument5 infrared5)
	(calibration_target instrument5 Star13)
	(calibration_target instrument5 GroundStation11)
	(calibration_target instrument5 GroundStation12)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
)
(:goal (and
	(have_image Planet14 infrared3)
	(have_image Planet14 image0)
	(have_image Phenomenon15 infrared3)
	(have_image Star16 infrared1)
	(have_image Star17 image0)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 5
2. (calibrate satellite1 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 0 of 5
3. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 5
4. (turn_to satellite1 phenomenon15 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon15)
   goals met: 0 of 5
5. (take_image satellite1 phenomenon15 instrument3 infrared3)
   added: (have_image phenomenon15 infrared3)
   goals met: 1 of 5
6. (turn_to satellite1 planet14 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 planet14)
   goals met: 1 of 5
7. (take_image satellite1 planet14 instrument3 infrared3)
   added: (have_image planet14 infrared3)
   goals met: 2 of 5
8. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 2 of 5
9. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 2 of 5
10. (turn_to satellite1 star13 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star13)
   goals met: 2 of 5
11. (calibrate satellite1 instrument4 star13)
   added: (calibrated instrument4)
   goals met: 2 of 5
12. (turn_to satellite1 planet14 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 planet14)
   goals met: 2 of 5
13. (take_image satellite1 planet14 instrument4 image0)
   added: (have_image planet14 image0)
   goals met: 3 of 5
14. (turn_to satellite1 star16 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star16)
   goals met: 3 of 5
15. (take_image satellite1 star16 instrument4 infrared1)
   added: (have_image star16 infrared1)
   goals met: 4 of 5
16. (turn_to satellite1 star17 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star17)
   goals met: 4 of 5
17. (take_image satellite1 star17 instrument4 image0)
   added: (have_image star17 image0)
   goals met: 5 of 5
